export const worldMapData = [
    {
        name: '白雪村落 薑餅城', code: 'xmas', sub: '',
        x: 86.9, y: 2.5, w: 4.3, h: 5.5,
        monsters: [],
    },
    {
        name: '薑餅城原野', code: 'xmas_fild01', sub: '',
        x: 89.0, y: 8, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '運河之都 艾爾帕蘭', code: 'aldebaran', sub: '',
        x: 60.2, y: 29.8, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '妙勒尼山脈北邊山麓', code: 'mjolnir_12', sub: '',
        x: 60.2, y: 35.1, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '妙勒尼山脈北區 ', code: 'mjolnir_01', sub: '',
        x: 42.3, y: 40.5, w: 4.4, h: 5.5,
        monsters: [],
    },
    {
        name: '妙勒尼山脈北區 ', code: 'mjolnir_02', sub: '',
        x: 46.8, y: 40.5, w: 4.4, h: 5.5,
        monsters: [],
    },
    {
        name: '妙勒尼山脈北區 ', code: 'mjolnir_03', sub: '',
        x: 51.3, y: 40.5, w: 4.4, h: 5.5,
        monsters: [],
    },
    {
        name: '妙勒尼山脈北區 ', code: 'mjolnir_04', sub: '',
        x: 55.8, y: 40.5, w: 4.4, h: 5.5,
        monsters: [],
    },
    {
        name: '妙勒尼山脈北區', code: 'mjolnir_05', sub: '',
        x: 60.2, y: 40.5, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '克雷斯特漢姆古城', code: 'glast_01', sub: '',
        x: 29.0, y: 45.9, w: 4.3, h: 5.5,
        monsters: [],
    },
    {
        name: '妙勒尼山脈南區', code: 'mjolnir_10', sub: '',
        x: 60.2, y: 45.9, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '魔法之都 吉芬', code: 'geffen', sub: '',
        x: 42.4, y: 51.5, w: 4.2, h: 5.2,
        monsters: [],
    },
    {
        name: '普隆德拉區域', code: 'prt_fild01', sub: '',
        x: 60.2, y: 51.5, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '普隆德拉', code: 'prontera', sub: '',
        x: 60.2, y: 56.8, w: 4.2, h: 5.3,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '普隆德拉區域', code: 'prt_fild08', sub: '',
        x: 60.2, y: 62.0, w: 4.2, h: 5.5,
        monsters: [
            {id: '1002', count: '140',},
            {id: '1063', count: '0',},
            {id: '1007', count: '0',},
            {id: '2398', count: '0',},
            {id: '2770', count: '0',},
            {id: '1008', count: '0',},
            {id: '2699', count: '0',},
            {id: '2698', count: '0',},
            {id: '2697', count: '0',},
            {id: '2696', count: '0',},
        ],
    },
    {
        name: '衛星都市 依斯魯得島', code: 'izlude', sub: '',
        x: 64.4, y: 62.0, w: 4.2, h: 5.3,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '山岳之都 斐揚', code: 'payon', sub: '',
        x: 73.5, y: 67.5, w: 4.2, h: 5.2,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '海邊之都 克魔島', code: 'comodo', sub: '',
        x: 20.1, y: 83.2, w: 4.3, h: 5.5,
        monsters: [],
    },
    {
        name: '沙漠之都 夢羅克', code: 'morocc', sub: '',
        x: 44.5, y: 81, w: 4.3, h: 5.5,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '港口之都 艾爾貝塔', code: 'alberta', sub: '',
        x: 82.3, y: 86.5, w: 4.5, h: 5.6,
        monsters: [],
    },
    {
        name: '沈船', code: 'alb2trea', sub: '',
        x: 89.0, y: 83, w: 4.5, h: 5.6,
        monsters: [],
    },
    // ----------------------------------------------//
    {
        name: '發樂斯燈塔', code: 'cmd_fild07', sub: '',
        x: 35.7, y: 91.7, w: 4.3, h: 5.5,
        monsters: [],
    },
];